import { 选项记录器类 } from "../../用户界面/选项记录器.ts";
import type { 字符串, 数值 } from "../../运行时/全局常量.ts";
import type { 日记册类 } from "./日记册.ts";

export class 日记本类 {
    #选项记录器: 选项记录器类;
    #日记册集: 日记册类[] = [];

    constructor(选项记录器: 选项记录器类) {
        this.#选项记录器 = 选项记录器;
    }

    配置写日记(日期: 字符串, 编号: 数值){
        this.#选项记录器.定义新记录({
            日期: 日期,
            编号: 编号,
            选项模式: "单选",
            可选项: [
                { 编号: 0, 描述: "未书写" },
                { 编号: 1, 描述: "已书写" },
            ]
        });
    };

    装订成本(...册集: 日记册类[]) {
        this.#日记册集 = 册集;
    }
}
