import { 地图管理器类 } from "./map.js";
import { 时间管理器类 } from "./time_manager.js";

const 时间管理器 = new 时间管理器类();
const 地图管理器 = new 地图管理器类(时间管理器);

地图管理器.创建新地图({
    名称: "塞尔温庄园室内一层",
    资源组: {
        日间主图: 53018566, // resId: "$53018566"
        日间底图: 53018567, // resId: "$53018567"
        夜间主图: 53018569, // resId: "$53018569"
        夜间底图: 53018570, // resId: "$53018570"
    },
    入口列表: [
        {
            名称: "餐厅",
            资源组: {
                日间: 53018559, // resId: "$53018559"
                夜间: 53018560, // resId: "$53018560"
            },
            位置: [0, 0],
            去往: {
                类型: "场景",
                名称: "塞尔温庄园室内一层餐厅",
            },
        },
        {
            名称: "侧厅",
            资源组: {
                日间: 53018561, // resId: "$53018561"
                夜间: 53018562, // resId: "$53018562"
            },
            位置: [0, 0],
            去往: {
                类型: "场景",
                名称: "塞尔温庄园室内一层侧厅",
            },
        },
        {
            名称: "上楼",
            资源组: {
                日间: 53087912, // resId: "$53087912"
                夜间: 53018564, // resId: "$53018564"
            },
            位置: [0, 0],
            去往: {
                类型: "地图",
                名称: "塞尔温庄园室内二层",
            },
        },
    ],
});
// 更多地图...

地图管理器.配置入口({
    名称: "餐厅",
    位于: "塞尔温庄园室内一层",
    禁用: true,
    标题: "餐厅",
    描述: "这里是餐厅",
    执行: () => {},
});
// 更多入口配置...

地图管理器.显示地图("塞尔温庄园室内一层");
