import { 否, 是, 资源标识 } from "../全局常量";
import { 接口 } from "../运行时/易次元";

interface 教程面板参数 {
    resId: 资源标识;
}

interface 简单教程类构造参数 {
    面板: 教程面板参数[];
}

export class 简单教程类 {
    面板集合: 资源标识[] = [];
    当前面板: number = 0;

    constructor(参数: 简单教程类构造参数) {
        this.面板集合 = 参数.面板.map((面板参数) => 面板参数.resId);
    }

    async 显示() {
        const 面板数量 = this.面板集合.length;
        let 面板索引 = 0;
        for (const 面板图片资源唯一标识 of this.面板集合) {
            面板索引 += 1;
            const 图层名称 = `教程面板_${面板索引}_图层`;
            const 图片名称 = `教程面板_${面板索引}_图片`;
            await 接口.创建图层(图层名称, {
                层级索引: 100,
                位置: { 横: 640, 纵: 360 },
                锚点: { 横: 50, 纵: 50 },
                裁剪模式: 是,
                裁剪区域: { 宽: 1280, 高: 720 },
                是否可见: 否,
            });
            await 接口.创建图片(图片名称, {
                所属图层: 图层名称,
                资源标识: 面板图片资源唯一标识,
                位置: { 横: 640, 纵: 360 },
                锚点: { 横: 50, 纵: 50 },
            });
        }

        await 接口.创建图层("教程面板_按钮图层", {
            层级索引: 101,
            位置: { 横: 640, 纵: 360 },
            锚点: { 横: 50, 纵: 50 },
            裁剪模式: 是,
            裁剪区域: { 宽: 1280, 高: 720 },
            是否可见: 否,
        });

        await 接口.创建选项("教程面板_上一页按钮", {
            所属图层: "教程面板_按钮图层",
            资源标识: "$5105452", // resId: "$5105452",
            位置: { 横: 318, 纵: 372 },
            锚点: { 横: 50, 纵: 50 },
            点击音效: { 资源标识: "$532507", 音量: 80 },
            是否可见: 否,
        });

        await 接口.创建选项("教程面板_下一页按钮", {
            所属图层: "教程面板_按钮图层",
            资源标识: "$5105451", // resId: "$5105451",
            位置: { 横: 968, 纵: 372 },
            锚点: { 横: 50, 纵: 50 },
            点击音效: { 资源标识: "$532507", 音量: 80 },
            是否可见: 否,
        });

        await 接口.创建选项("教程面板_关闭按钮", {
            所属图层: "教程面板_按钮图层",
            资源标识: "$51035453", // resId: "$51035453",
            位置: { 横: 948, 纵: 578 },
            锚点: { 横: 50, 纵: 50 },
            是否可见: 否,
        });
    }
}

async function 测试() {
    const 教程面板 = new 简单教程类({
        面板: [{ resId: "$51544832" }, { resId: "$51544833" }],
    });
    await 教程面板.显示();
}
