import { 对象属性探针类 } from "../应用/对象属性探针.ts";
import type { 坐标元组, 字符串, 数值, 无, 资源标识 } from "../运行时/全局常量.ts";
import { 已选择, 是, 未定义 } from "../运行时/全局常量.ts";
import { 接口 } from "../运行时/易次元.ts";
import { 承诺 } from "../运行时/网络/承诺.ts";
import { 错误 } from "../运行时/网络/错误.ts";
import type { 执行器 } from "./选项记录器.ts";
import { 选项记录器类 } from "./选项记录器.ts";

type 显示面板参数 = {
    编号: 数值;
};

type 创建对话选项参数 = {
    选项内容: 字符串;
    执行结果?: 执行器;
};

type 创建对话选项面板参数 = {
    编号: 数值;
    描述: 字符串;
    可选项: 对话选项[];
    日期: 字符串;
};

type 属性探针检测结果 = {
    属性: 字符串;
    变化: 数值;
};

type 条件 = {
    需满足: () => boolean;
    当不满足时提示: 字符串;
};

class 对话选项 {
    内容 = "";
    条件集: 条件[] = [];

    结果执行函数?: 执行器;
}

export class 对话面板管理器类 {
    // deno-fmt-ignore: 特定布局数组不需要格式化
    #预定义对话选项布局: 坐标元组[][] = [
        [ 
            [376, 120], [924, 120]
        ],
        [ 
            [376, 148], [924, 148],
            [376,  83],
        ],
        [
            [376, 148], [924, 148],
            [376,  83], [924,  83]
        ],
        [],
        [],
        [],
        [],
    ];

    #选项记录器: 选项记录器类;

    #获取预定义对话选项布局(选项数量: number): 坐标元组[] {
        // 复制数组，避免修改原数组
        return this.#预定义对话选项布局[选项数量 - 2].map((坐标) => [...坐标]);
    }

    #获取蔷薇徽章动画序列(属性探针检测结果: 属性探针检测结果[]): { 资源标识: 资源标识; 时长: 数值 }[] {
        if (属性探针检测结果.length === 0) {
            return [
                { 资源标识: "$54010987", 时长: 14 }, // resId: "$54010987"
                { 资源标识: "$54010469", 时长: 14 }, // resId: "$54010469"
                { 资源标识: "$54010470", 时长: 14 }, // resId: "$54010470"
                { 资源标识: "$54010471", 时长: 14 }, // resId: "$54010471"
                { 资源标识: "$54010472", 时长: 14 }, // resId: "$54010472"
                { 资源标识: "$54010473", 时长: 14 }, // resId: "$54010473"
                { 资源标识: "$54010474", 时长: 14 }, // resId: "$54010474"
                { 资源标识: "$54010475", 时长: 14 }, // resId: "$54010475"
                { 资源标识: "$54010476", 时长: 14 }, // resId: "$54010476"
                { 资源标识: "$54010477", 时长: 14 }, // resId: "$54010477"
                { 资源标识: "$54010478", 时长: 14 }, // resId: "$54010478"
                { 资源标识: "$54010479", 时长: 14 }, // resId: "$54010479"
                { 资源标识: "$54010480", 时长: 14 }, // resId: "$54010480"
                { 资源标识: "$54010481", 时长: 14 }, // resId: "$54010481"
                { 资源标识: "$54010482", 时长: 14 }, // resId: "$54010482"
                { 资源标识: "$54010483", 时长: 14 }, // resId: "$54010483"
                { 资源标识: "$54010484", 时长: 14 }, // resId: "$54010484"
                { 资源标识: "$54010485", 时长: 14 }, // resId: "$54010485"
                { 资源标识: "$54010486", 时长: 14 }, // resId: "$54010486"
                { 资源标识: "$54010487", 时长: 14 }, // resId: "$54010487"
                { 资源标识: "$54010488", 时长: 14 }, // resId: "$54010488"
                { 资源标识: "$54010489", 时长: 14 }, // resId: "$54010489"
                { 资源标识: "$54010490", 时长: 14 }, // resId: "$54010490"
                { 资源标识: "$54010491", 时长: 14 }, // resId: "$54010491"
                { 资源标识: "$54010492", 时长: 14 }, // resId: "$54010492"
                { 资源标识: "$54010493", 时长: 14 }, // resId: "$54010493"
                { 资源标识: "$54010494", 时长: 14 }, // resId: "$54010494"
                { 资源标识: "$54010495", 时长: 14 }, // resId: "$54010495"
                { 资源标识: "$54010496", 时长: 14 }, // resId: "$54010496"
                { 资源标识: "$54010497", 时长: 14 }, // resId: "$54010497"
                { 资源标识: "$54010498", 时长: 14 }, // resId: "$54010498"
                { 资源标识: "$54010499", 时长: 14 }, // resId: "$54010499"
                { 资源标识: "$54010500", 时长: 14 }, // resId: "$54010500"
                { 资源标识: "$54010501", 时长: 14 }, // resId: "$54010501"
                { 资源标识: "$54010502", 时长: 14 }, // resId: "$54010502"
                { 资源标识: "$54010503", 时长: 14 }, // resId: "$54010503"
                { 资源标识: "$54010504", 时长: 14 }, // resId: "$54010504"
                { 资源标识: "$54010505", 时长: 14 }, // resId: "$54010505"
                { 资源标识: "$54010506", 时长: 14 }, // resId: "$54010506"
                { 资源标识: "$54010507", 时长: 14 }, // resId: "$54010507"
                { 资源标识: "$54010508", 时长: 14 }, // resId: "$54010508"
                { 资源标识: "$54010509", 时长: 14 }, // resId: "$54010509"
                { 资源标识: "$54010510", 时长: 14 }, // resId: "$54010510"
                { 资源标识: "$54010511", 时长: 14 }, // resId: "$54010511"
                { 资源标识: "$54010512", 时长: 14 }, // resId: "$54010512"
                { 资源标识: "$54010513", 时长: 14 }, // resId: "$54010513"
                { 资源标识: "$54010514", 时长: 14 }, // resId: "$54010514"
                { 资源标识: "$54010515", 时长: 14 }, // resId: "$54010515"
                { 资源标识: "$54010516", 时长: 14 }, // resId: "$54010516"
                { 资源标识: "$54010987", 时长: 14 }, // resId: "$54010987"
            ];
        }
        if (属性探针检测结果.find((检测结果) => 检测结果.属性 === "谦逊")?.变化 ?? 0 > 0) {
            return [
                { 资源标识: "$51533657", 时长: 18 }, // resId: "$51533657"
                { 资源标识: "$51533428", 时长: 18 }, // resId: "$51533428"
                { 资源标识: "$51533429", 时长: 18 }, // resId: "$51533429"
                { 资源标识: "$51533430", 时长: 18 }, // resId: "$51533430"
                { 资源标识: "$51533431", 时长: 18 }, // resId: "$51533431"
                { 资源标识: "$51533433", 时长: 18 }, // resId: "$51533433"
                { 资源标识: "$51533434", 时长: 18 }, // resId: "$51533434"
                { 资源标识: "$51533435", 时长: 18 }, // resId: "$51533435"
                { 资源标识: "$51533436", 时长: 18 }, // resId: "$51533436"
                { 资源标识: "$51533437", 时长: 18 }, // resId: "$51533437"
                { 资源标识: "$51533438", 时长: 18 }, // resId: "$51533438"
                { 资源标识: "$51533439", 时长: 18 }, // resId: "$51533439"
                { 资源标识: "$51533440", 时长: 18 }, // resId: "$51533440"
                { 资源标识: "$51533441", 时长: 18 }, // resId: "$51533441"
                { 资源标识: "$51533442", 时长: 18 }, // resId: "$51533442"
                { 资源标识: "$51533443", 时长: 18 }, // resId: "$51533443"
                { 资源标识: "$51533444", 时长: 18 }, // resId: "$51533444"
                { 资源标识: "$51533445", 时长: 18 }, // resId: "$51533445"
                { 资源标识: "$51533446", 时长: 18 }, // resId: "$51533446"
                { 资源标识: "$51533447", 时长: 18 }, // resId: "$51533447"
                { 资源标识: "$51533448", 时长: 18 }, // resId: "$51533448"
                { 资源标识: "$51533449", 时长: 18 }, // resId: "$51533449"
                { 资源标识: "$51533450", 时长: 18 }, // resId: "$51533450"
                { 资源标识: "$51533451", 时长: 18 }, // resId: "$51533451"
                { 资源标识: "$51533452", 时长: 18 }, // resId: "$51533452"
                { 资源标识: "$51533453", 时长: 18 }, // resId: "$51533453"
                { 资源标识: "$51533454", 时长: 18 }, // resId: "$51533454"
                { 资源标识: "$51533455", 时长: 18 }, // resId: "$51533455"
                { 资源标识: "$51533657", 时长: 18 }, // resId: "$51533657"
            ];
        }

        if (属性探针检测结果.find((检测结果) => 检测结果.属性 === "傲慢")?.变化 ?? 0 > 0) {
            return [
                { 资源标识: "$51533657", 时长: 18 }, // resId: "$51533657"
                { 资源标识: "$51541582", 时长: 18 }, // resId: "$51541582"
                { 资源标识: "$51541583", 时长: 18 }, // resId: "$51541583"
                { 资源标识: "$51541584", 时长: 18 }, // resId: "$51541584"
                { 资源标识: "$51541585", 时长: 18 }, // resId: "$51541585"
                { 资源标识: "$51541586", 时长: 18 }, // resId: "$51541586"
                { 资源标识: "$51541587", 时长: 18 }, // resId: "$51541587"
                { 资源标识: "$51541588", 时长: 18 }, // resId: "$51541588"
                { 资源标识: "$51541589", 时长: 18 }, // resId: "$51541589"
                { 资源标识: "$51541590", 时长: 18 }, // resId: "$51541590"
                { 资源标识: "$51541591", 时长: 18 }, // resId: "$51541591"
                { 资源标识: "$51541592", 时长: 18 }, // resId: "$51541592"
                { 资源标识: "$51541593", 时长: 18 }, // resId: "$51541593"
                { 资源标识: "$51541594", 时长: 18 }, // resId: "$51541594"
                { 资源标识: "$51541595", 时长: 18 }, // resId: "$51541595"
                { 资源标识: "$51541596", 时长: 18 }, // resId: "$51541596"
                { 资源标识: "$51541597", 时长: 18 }, // resId: "$51541597"
                { 资源标识: "$51541598", 时长: 18 }, // resId: "$51541598"
                { 资源标识: "$51541599", 时长: 18 }, // resId: "$51541599"
                { 资源标识: "$51541600", 时长: 18 }, // resId: "$51541600"
                { 资源标识: "$51541601", 时长: 18 }, // resId: "$51541601"
                { 资源标识: "$51541602", 时长: 18 }, // resId: "$51541602"
                { 资源标识: "$51541603", 时长: 18 }, // resId: "$51541603"
                { 资源标识: "$51541604", 时长: 18 }, // resId: "$51541604"
                { 资源标识: "$51541605", 时长: 18 }, // resId: "$51541605"
                { 资源标识: "$51541606", 时长: 18 }, // resId: "$51541606"
                { 资源标识: "$51541607", 时长: 18 }, // resId: "$51541607"
                { 资源标识: "$51541608", 时长: 18 }, // resId: "$51541608"
                { 资源标识: "$51541609", 时长: 18 }, // resId: "$51541609"
                { 资源标识: "$51541610", 时长: 18 }, // resId: "$51541610"
                { 资源标识: "$51541611", 时长: 18 }, // resId: "$51541611"
                { 资源标识: "$51541612", 时长: 18 }, // resId: "$51541612"
                { 资源标识: "$51541613", 时长: 18 }, // resId: "$51541613"
                { 资源标识: "$51541614", 时长: 18 }, // resId: "$51541614"
                { 资源标识: "$51541615", 时长: 18 }, // resId: "$51541615"
                { 资源标识: "$51533657", 时长: 18 }, // resId: "$51533657"
            ];
        }

        throw alert("尚未实现其它属性变化时的蔷薇徽章动画！");
    }

    constructor(选项记录器: 选项记录器类) {
        this.#选项记录器 = 选项记录器;
    }

    创建对话选项面板(参数: 创建对话选项面板参数) {
        if (!Number.isSafeInteger(参数.编号)) throw new 错误("对话选项面板必须有编号！");
        if (!参数.描述) throw new 错误("对话选项面板必须有描述！");
        if (参数.日期 === 未定义) throw new 错误(`对话选项面板<编号 ${参数.编号}>必须有日期！`);
        if (参数.可选项.length < 2 || 参数.可选项.length > 7) throw new 错误("对话选项面板必须有2到6个选项！");

        this.#选项记录器.定义新记录({
            编号: 参数.编号,
            日期: 参数.日期,
            描述: 参数.描述,
            选项模式: "单选",
            可选项: 参数.可选项.map((选项, 索引) => {
                return {
                    编号: 索引,
                    描述: 选项.内容,
                    执行结果: 选项.结果执行函数,
                };
            }),
        });
    }

    创建对话选项(参数: 创建对话选项参数) {
        const 选项 = new 对话选项();
        选项.内容 = 参数.选项内容;
        选项.结果执行函数 = 参数?.执行结果;
        return 选项;
    }

    /**
     * 显示指定编号的对话选项面板。
     * @param 参数 - 显示面板的参数
     * @param 对应选项的回调函数 - 在剧情中配置的选项回调函数，顺序与选项的顺序一致
     */
    async 显示对话选项面板(参数: 显示面板参数, ...对应选项的回调函数: Function[]) {
        // const 面板 = this.#面板集合[参数.编号];
        const 记录 = this.#选项记录器.获取记录(参数.编号);
        const 图层名称 = `对话选项面板_${参数.编号}_图层`;
        await 接口.创建图层(图层名称, {
            裁剪模式: 是,
            裁剪区域: { 宽: 1280, 高: 720 },
        });
        await 接口.创建图片(`对话选项面板_${参数.编号}_底板`, {
            所属图层: 图层名称,
            资源标识: "$51362891", // resId: "$51362891"
            位置: { 横: 652, 纵: 130 },
            锚点: { 横: 50, 纵: 50 },
        });
        const 蔷薇徽章名称 = `对话选项面板_${参数.编号}_蔷薇徽章`;
        await 接口.创建图片(蔷薇徽章名称, {
            所属图层: 图层名称,
            资源标识: "$51362896", // 灰蔷薇徽章
            位置: { 横: 652, 纵: 116 },
            锚点: { 横: 50, 纵: 50 },
        });

        const 选项布局 = this.#获取预定义对话选项布局(记录.可选项.length);

        await new 承诺<无>((履行) => {
            for (const 选项 of 记录.可选项) {
                const 坐标 = 选项布局.shift();
                if (!坐标) throw alert(`对话选项面板<${参数.编号}>的选项布局不足！`);
                // const 选项编号 = 选项.编号 + 1;
                接口.创建选项(`对话选项面板_${参数.编号}_选项_${选项.编号}`, {
                    层级索引: 1,
                    所属图层: 图层名称,
                    正常态资源标识: "$51362894", // nResId: "$51362894"
                    点击态资源标识: "$51362892", // sResId: "$51362892"
                    选项文字: 选项.描述,
                    位置: { 横: 坐标[0], 纵: 坐标[1] },
                    锚点: { 横: 50, 纵: 50 },
                    当点触结束时: async () => {
                        // const 属性探针 = this.#人物管理器.黛瑞雅.获取属性探针();
                        new 对象属性探针类();
                        记录.记录选择(选项.编号);

                        const 动画序列 = this.#获取蔷薇徽章动画序列(属性探针.检测());
                        接口.移除对象(蔷薇徽章名称);
                        接口.播放音频("蔷薇徽章动画音效", { 资源标识: "$51542664" }); // 蔷薇徽章动画音效

                        await 接口.创建动画序列("rose_animate", {
                            所属图层: 图层名称,
                            动画序列,
                            位置: { 横: 652, 纵: 116 },
                            锚点: { 横: 50, 纵: 50 },
                            是否可见: 是,
                        });
                        await 接口.延迟(1000);
                        await 接口.移除对象(图层名称, { 时长: 500 });
                        await 对应选项的回调函数[选项.编号]?.();

                        履行();
                    },
                });
            }
        });
    }

    /**
     * @param 参数 - 对话选项面板的编号
     */
    查询对话选项面板结果(参数: { 编号: number }) {
        return this.#选项记录器.查询({ 编号: 参数.编号 }).findIndex((选择状态) => 选择状态 === 已选择) + 1;
    }
}
