import { 获取随机数 } from "../工具.js";
import { 事件目标, 自定义事件 } from "./事件目标.js";
import { 时间管理器类 } from "./时间管理器.js";
import { 易次元 } from "./易次元.js";

export class 日记管理器类 extends 事件目标 {
    #时间管理器: 时间管理器类;
    #日记贴纸: { [日期: 字符串]: 资源标识 } = {};

    #日记月份资源: 资源标识[] = [
        /**   一月 **/ "$52524682", // resId: $52524682
        /**   二月 **/ "$52524682", // resId: $52524682
        /**   三月 **/ "$52524682", // resId: $52524682
        /**   四月 **/ "$52524682", // resId: $52524682
        /**   五月 **/ "$52524682", // resId: $52524682
        /**   六月 **/ "$52524457", // resId: $52524457
        /**   七月 **/ "$52524682", // resId: $52524682
        /**   八月 **/ "$52524682", // resId: $52524682
        /**   九月 **/ "$52524682", // resId: $52524682
        /**   十月 **/ "$52524682", // resId: $52524682
        /** 十一月 **/ "$52524682", // resId: $52524682
        /** 十二月 **/ "$52524682", // resId: $52524682
    ];
    // rome-ignore format: 特定布局数组不需要格式化
    #贴纸位置: { [日期: 字符串]: { 横: 数值; 纵: 数值 } } = {
                                                                                                                    "1991-06-05": { 横: 826, 纵: 315 }, "1991-06-06": { 横: 878, 纵: 315 }, "1991-06-07": { 横: 925, 纵: 315 }, "1991-06-08": { 横: 980, 纵: 322 },
        "1991-06-09": { 横: 685, 纵: 265 }, "1991-06-10": { 横: 732, 纵: 269 }, "1991-06-11": { 横: 775, 纵: 267 }, "1991-06-12": { 横: 825, 纵: 267 }, "1991-06-13": { 横: 881, 纵: 269 }, "1991-06-14": { 横: 927, 纵: 267 }, "1991-06-15": { 横: 982, 纵: 273 },
        "1991-06-16": { 横: 687, 纵: 219 }, "1991-06-17": { 横: 729, 纵: 220 }, "1991-06-18": { 横: 775, 纵: 221 }, "1991-06-19": { 横: 833, 纵: 219 }, "1991-06-20": { 横: 879, 纵: 224 }, "1991-06-21": { 横: 933, 纵: 218 }, "1991-06-22": { 横: 990, 纵: 220 },
        "1991-06-23": { 横: 685, 纵: 173 }, "1991-06-24": { 横: 732, 纵: 174 }, "1991-06-25": { 横: 783, 纵: 178 }, "1991-06-26": { 横: 833, 纵: 176 }, "1991-06-27": { 横: 879, 纵: 173 }, "1991-06-28": { 横: 933, 纵: 173 }, "1991-06-29": { 横: 990, 纵: 173 },
        "1991-06-30": { 横: 685, 纵: 127 },
    };

    constructor(时间管理器: 时间管理器类) {
        super();
        this.#时间管理器 = 时间管理器;
    }

    配置日记贴纸(日记贴纸: { [日期: 字符串]: 资源标识 }) {
        this.#日记贴纸 = 日记贴纸;
    }

    async 打开日记本() {
        await 易次元.播放音频("日记本出现音效", { 资源标识: "$50698523" }); // resId: "$50698523"
        await 易次元.创建图层("项链菜单_日记本_图层", {
            层级索引: 160,
            位置: { 横: 640, 纵: 360 },
            锚点: { 横: 50, 纵: 50 },
            裁剪模式: 是,
            裁剪区域: { 宽: 1280, 高: 720 },
            是否可见: 否,
        });

        await 易次元.创建图片("项链菜单_日记本_图片", {
            所属图层: "项链菜单_日记本_图层",
            资源标识: "$52524464", // resId: "$52524464"
            位置: { 横: 640, 纵: 360 },
            锚点: { 横: 50, 纵: 50 },
        });

        await 易次元.创建图片("项链菜单_日记本_月份_图片", {
            所属图层: "项链菜单_日记本_图层",
            资源标识: this.#日记月份资源[this.#时间管理器.获取当前月份() - 1],
            位置: { 横: 865, 纵: 412 },
        });

        await 易次元.创建选项("项链菜单_日记本_返回_选项", {
            所属图层: "项链菜单_日记本_图层",
            正常态资源标识: "$52524460", // resId: "$52524460"
            点击态资源标识: "$52524460", // resId: "$52524460"
            位置: { 横: 1165, 纵: 325 },
            当点触结束时: async () => {
                this.触发事件(new 自定义事件("关闭日记本"));
                await 易次元.移除对象("项链菜单_日记本_图层", { 效果: 易次元.消失效果.淡出, 时长: 300 });
            },
        });

        for (const 日期 in this.#日记贴纸) {
            const 贴纸资源标识 = this.#日记贴纸[日期];
            const 贴纸位置 = this.#贴纸位置[日期];

            if (!贴纸位置) throw alert(`日记本贴纸位置未配置: ${日期}`);

            await 易次元.创建选项(`项链菜单_日记本_${日期}_选项`, {
                所属图层: "项链菜单_日记本_图层",
                正常态资源标识: 贴纸资源标识,
                点击态资源标识: 贴纸资源标识,
                位置: 贴纸位置,
            });
        }

        this.触发事件(new 自定义事件("打开日记本"));
        await 易次元.显示对象("项链菜单_日记本_图层", { 效果: 易次元.出现效果.淡入, 时长: 300 });
    }
}
