import { 易次元 } from "./易次元.js";

type 项链菜单配置 = {
    记忆回溯: 解锁状态;
    日记本: 解锁状态;
    钥匙: 解锁状态;
};

export class 项链菜单类 {
    async 显示(配置: 项链菜单配置) {
        await 易次元.创建图层({
            名称: "项链菜单_图层",
            层级索引: 200,
            是否可见: 是,
            位置: { 横: 640, 纵: 360 },
            锚点: { 横: 50, 纵: 50 },
            裁剪模式: 是,
            裁剪区域: { 宽: 1280, 高: 720 },
        });

        await 易次元.创建图片({
            名称: "项链菜单_按钮_未激活_图片",
            资源标识: "$51561734", // resId: "$51561734"
            所属图层: "项链菜单_图层",
            位置: { 横: 1188, 纵: 658 },
            锚点: { 横: 50, 纵: 50 },
        });

        await 易次元.添加事件侦听器("项链菜单_按钮_未激活_图片", 易次元.事件类型.点触结束, async () => {
            易次元.播放音频({ 名称: "播放打开菜单音效", 资源标识: "$51624" }); //resId: "$51624"
            await 易次元.创建图片({
                名称: "项链菜单_背景雾_图片",
                资源标识: "$51703715", // resId: "$51703715"
                层级索引: 100,
                位置: { 横: 640, 纵: 360 },
                锚点: { 横: 50, 纵: 50 },
                动态缩放模式: 最大填充,
                是否可见: 否,
            });
            await 易次元.创建图片({
                名称: "项链菜单_背景雾遮罩_图片",
                资源标识: "$51398051", // resId: "$51398051"
                层级索引: 100,
                位置: { 横: 640, 纵: 360 },
                锚点: { 横: 50, 纵: 50 },
                动态缩放模式: 最大填充,
                是否可见: 否,
            });

            易次元.播放音频({ 名称: "烟雾出现音效", 资源标识: "$51542664" }); // resId: "$51542664"

            await Promise.all([
                易次元.显示对象({ 名称: "项链菜单_背景雾_图片", 效果: 易次元.显示效果.淡入, 时间: 1000 }),
                易次元.显示对象({ 名称: "项链菜单_背景雾遮罩_图片", 效果: 易次元.显示效果.淡入, 时间: 1000 }),
            ]);

            易次元.播放音频({ 名称: "书本出现音效", 资源标识: "$50762903" }); // resId: "$50762903"

            await 易次元.创建图层({
                名称: "项链菜单_交互_图层",
                层级索引: 150,
                是否可见: 是,
                位置: { 横: 640, 纵: 360 },
                锚点: { 横: 50, 纵: 50 },
                裁剪模式: 是,
                裁剪区域: { 宽: 1280, 高: 720 },
            });

            await 易次元.创建图片({
                名称: "项链菜单_交互_左侧神秘书籍_图片",
                所属图层: "项链菜单_交互_图层",
                资源标识: "$52024436", // resId: "$52024436",
                位置: { 横: 318, 纵: 254 },
                锚点: { 横: 50, 纵: 50 },
            });

            await 易次元.创建图片({
                名称: "项链菜单_交互_日记本_图片",
                所属图层: "项链菜单_交互_图层",
                资源标识: "$52024247", // resId: "$52024247",
                位置: { 横: 646, 纵: 356 },
                锚点: { 横: 50, 纵: 50 },
            });

            await 易次元.创建图片({
                名称: "项链菜单_交互_右侧神秘书籍_图片",
                所属图层: "项链菜单_交互_图层",
                资源标识: "$51703666", // resId: "$51703666",
                位置: { 横: 974, 纵: 274 },
                锚点: { 横: 50, 纵: 50 },
            });
        });
    }
}
