import "./测试环境.ts";

import { assertEquals, assertExists, assertThrows } from "https://deno.land/std@0.185.0/testing/asserts.ts";
import { 变量容器类, 选项记录器类 } from "../src/用户界面/选项记录器.ts";
import { 已选择, 未选择 } from "../src/运行时/全局常量.ts";
import { 变量 } from "../src/运行时/易次元.ts";

Deno.test("选项记录器", () => {
    const 选项记录器 = new 选项记录器类();

    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.傲慢 += 3) },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    选项记录器.定义新记录({
        编号: 1,
        日期: "1992-06-05",
        描述: "第二次选项",
        选项模式: "多选",
        可选项: [
            { 编号: 0, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.傲慢 += 3) },
            { 编号: 1, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.谦逊 += 3) },
            { 编号: 2, 执行结果: () => {} },
        ],
    });

    选项记录器.记录([
        { 编号: 0, 选项: 0 },
        { 编号: 1, 选项: 0 },
        { 编号: 1, 选项: 2 },
    ]);
    assertEquals(变量.内存, [0b0001, 0b0101]);
});

Deno.test("选项记录器 - 构造", () => {
    const 选项记录器 = new 选项记录器类();

    assertExists(选项记录器);
});

Deno.test("选项记录器 - 定义新记录", () => {
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });
});

Deno.test("选项记录器 - 定义新记录 - 可选项编号不为从 0 开始的接续序号时须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    assertThrows(() => {
        选项记录器.定义新记录({
            编号: 0,
            日期: "1992-06-05",
            描述: "第一次选项",
            选项模式: "单选",
            可选项: [
                { 编号: 0, 执行结果: () => {} },
                { 编号: 1, 执行结果: () => {} },
                { 编号: 2, 执行结果: () => {} },
                { 编号: 4, 执行结果: () => {} },
            ],
        });
    });

    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertThrows(() => {
        选项记录器.定义新记录({
            编号: 0,
            日期: "1992-06-05",
            描述: "第一次选项",
            选项模式: "单选",
            可选项: [
                { 编号: 1, 执行结果: () => {} },
                { 编号: 2, 执行结果: () => {} },
                { 编号: 3, 执行结果: () => {} },
                { 编号: 4, 执行结果: () => {} },
            ],
        });
    });
});

Deno.test("选项记录器 - 定义新记录 - 重复定义须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertThrows(() => {
        选项记录器.定义新记录({
            编号: 0,
            日期: "1992-06-05",
            描述: "第一次选项",
            选项模式: "单选",
            可选项: [
                { 编号: 0, 执行结果: () => {} },
                { 编号: 1, 执行结果: () => {} },
                { 编号: 2, 执行结果: () => {} },
                { 编号: 3, 执行结果: () => {} },
            ],
        });
    });
});

Deno.test("选项记录器 - 定义新记录 - 单选记录时，可选项少于 2 个须抛错", () => {
    const 选项记录器 = new 选项记录器类();

    assertThrows(() => {
        选项记录器.定义新记录({
            编号: 0,
            日期: "1992-06-05",
            描述: "第一次选项",
            选项模式: "单选",
            可选项: [],
        });
    });
});

Deno.test("选项记录器 - 定义新记录 - 缺少必填项时须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    // deno-lint-ignore no-explicit-any
    type 任意 = any;

    assertThrows(() => {
        选项记录器.定义新记录({} as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0 } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 日期: "1992-06-05" } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 日期: "1992-06-05", 选项模式: "单选" } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 日期: "1992-06-05", 选项模式: "单选", 可选项: [] } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 日期: "1992-06-05", 可选项: [] } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 选项模式: "单选", 可选项: [] } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 日期: "1992-06-05", 选项模式: "单选", 可选项: [] } as 任意);
    });

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 可选项: [] } as 任意);
    });
});

Deno.test("选项记录器 - 定义新记录 - 选项模式仅可为 `单选` 与 `多选` ", () => {
    const 选项记录器 = new 选项记录器类();
    // deno-lint-ignore no-explicit-any
    type 任意 = any;

    assertThrows(() => {
        选项记录器.定义新记录({ 编号: 0, 日期: "1992-06-05", 选项模式: "非法值", 可选项: [] } as 任意);
    });
});

Deno.test("选项记录器 - 记录 - 记录编号未定义过的记录须抛错", () => {
    const 选项记录器 = new 选项记录器类();

    assertThrows(() => {
        选项记录器.记录({ 编号: 0, 选项: 0 });
    });
});

Deno.test("选项记录器 - 记录 - 选项编号必须在可选项范围内", () => {
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertThrows(() => {
        选项记录器.记录({ 编号: 0, 选项: 4 });
    });
});

Deno.test("选项记录器 - 记录 - 单选个模式 - 重复记录同一选项，须重置先前的选择", () => {
    变量.内存.fill(0);
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 未选择);
    选项记录器.记录({ 编号: 0, 选项: 0 });
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 已选择);

    选项记录器.记录({ 编号: 0, 选项: 1 });
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 1 }), 已选择);
});

Deno.test("选项记录器 - 记录 - 多选模式 - 重复记录同一选项，须保留先前的选择", () => {
    变量.内存.fill(0);
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "多选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 未选择);
    选项记录器.记录({ 编号: 0, 选项: 0 });
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 已选择);

    选项记录器.记录({ 编号: 0, 选项: 1 });
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 已选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 1 }), 已选择);
});

Deno.test("选项记录器 - 记录 - 批量设置", () => {
    变量.内存.fill(0);
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "多选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });
    选项记录器.定义新记录({
        编号: 1,
        日期: "1992-06-05",
        描述: "第二次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
        ],
    });

    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 1 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 2 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 3 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 1, 选项: 0 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 1, 选项: 1 }), 未选择);

    选项记录器.记录([
        { 编号: 0, 选项: 0 },
        { 编号: 0, 选项: 2 },
        { 编号: 1, 选项: 1 },
    ]);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 已选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 1 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 2 }), 已选择);
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 3 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 1, 选项: 0 }), 未选择);
    assertEquals(选项记录器.查询({ 编号: 1, 选项: 1 }), 已选择);
});

Deno.test("选项记录器 - 查询 - 查询编号未定义过的记录须抛错", () => {
    const 选项记录器 = new 选项记录器类();

    assertThrows(() => {
        选项记录器.查询({ 编号: 0, 选项: 0 });
    });
});

Deno.test("选项记录器 - 查询 - 查询编号已定义过的记录，但未记录过选项，须返回未选择", () => {
    变量.内存.fill(0);

    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 未选择);
});

Deno.test("选项记录器 - 查询 - 查询编号已定义过的记录，且已记录过选项，须返回已选择", () => {
    变量.内存.fill(0);

    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    选项记录器.记录({ 编号: 0, 选项: 0 });
    assertEquals(选项记录器.查询({ 编号: 0, 选项: 0 }), 已选择);
});

Deno.test("选项记录器 - 查询 - 选项编号未定义的记录，须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertThrows(() => {
        选项记录器.查询({ 编号: 0, 选项: 4 });
    });
});

Deno.test("选项记录器 - 查询 - 所有选项的选择状态", () => {
    变量.内存.fill(0);

    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "多选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    选项记录器.记录({ 编号: 0, 选项: 0 });
    assertEquals(选项记录器.查询({ 编号: 0 }), [已选择, 未选择, 未选择, 未选择]);

    选项记录器.记录({ 编号: 0, 选项: 1 });
    assertEquals(选项记录器.查询({ 编号: 0 }), [已选择, 已选择, 未选择, 未选择]);
});

Deno.test("选项记录器 - 获取执行器", () => {
    变量.内存.fill(0);
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });
    选项记录器.获取执行器();
});

Deno.test("选项记录器 - 获取执行器 - 选项编号未定义的记录，须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: () => {} },
            { 编号: 1, 执行结果: () => {} },
            { 编号: 2, 执行结果: () => {} },
            { 编号: 3, 执行结果: () => {} },
        ],
    });

    assertThrows(() => {
        选项记录器.获取执行器({ 编号: 1 });
    });
});

Deno.test("选项记录器 - 获取执行器 - 获取所有记录的执行器", () => {
    const 选项记录器 = new 选项记录器类();
    const 执行器1 = () => {};
    const 执行器2 = () => {};
    const 执行器3 = () => {};
    const 执行器4 = () => {};
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: 执行器1 },
            { 编号: 1, 执行结果: 执行器2 },
        ],
    });
    选项记录器.定义新记录({
        编号: 1,
        日期: "1992-06-05",
        描述: "第二次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: 执行器3 },
            { 编号: 1, 执行结果: 执行器4 },
        ],
    });

    assertEquals(选项记录器.获取执行器(), [执行器1, 执行器2, 执行器3, 执行器4]);
});

Deno.test("选项记录器 - 获取执行器 - 给定记录编号，获取该记录下所有的执行器", () => {
    const 选项记录器 = new 选项记录器类();
    const 执行器1 = () => {};
    const 执行器2 = () => {};
    const 执行器3 = () => {};
    const 执行器4 = () => {};
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: 执行器1 },
            { 编号: 1, 执行结果: 执行器2 },
        ],
    });
    选项记录器.定义新记录({
        编号: 1,
        日期: "1992-06-05",
        描述: "第二次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: 执行器3 },
            { 编号: 1, 执行结果: 执行器4 },
        ],
    });

    assertEquals(选项记录器.获取执行器({ 编号: 1 }), [执行器3, 执行器4]);
});

Deno.test("选项记录器 - 获取执行器 - 给定选择状态，获取所有记录下指定选择状态的执行器", () => {
    const 选项记录器 = new 选项记录器类();
    const 执行器1 = () => {};
    const 执行器2 = () => {};
    const 执行器3 = () => {};
    const 执行器4 = () => {};
    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: 执行器1 },
            { 编号: 1, 执行结果: 执行器2 },
        ],
    });
    选项记录器.定义新记录({
        编号: 1,
        日期: "1992-06-05",
        描述: "第二次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: 执行器3 },
            { 编号: 1, 执行结果: 执行器4 },
        ],
    });

    选项记录器.记录([
        { 编号: 0, 选项: 1 },
        { 编号: 1, 选项: 0 },
    ]);

    assertEquals(选项记录器.获取执行器({ 选择状态: 已选择 }), [执行器2, 执行器3]);
});

Deno.test("变量容器", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.傲慢");
    变量容器.创建数值变量("黛瑞雅.谦逊");
    变量容器.创建数值变量("黛瑞雅.荣誉");
    变量容器.创建数值变量("背包.书籍.魁地奇决赛锦集");
    变量容器.查询变量初始值("黛瑞雅.傲慢");
    变量容器.查询变量初始值("背包.书籍.魁地奇决赛锦集");

    // console.log(变量容器.获取初始变量对象());
    // 变量容器.查询("黛瑞雅");
    // 变量容器.查询("背包");
});

Deno.test("变量容器 - 构造", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    assertExists(变量容器);
});

Deno.test("变量容器 - 创建数值变量", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.傲慢");
    变量容器.创建数值变量("黛瑞雅.谦逊");
    变量容器.创建数值变量("黛瑞雅.荣誉");
    变量容器.创建数值变量("背包.书籍.魁地奇决赛锦集");
});

Deno.test("变量容器 - 创建数值变量 - 重复创建同名变量，须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.傲慢");
    assertThrows(() => {
        变量容器.创建数值变量("黛瑞雅.傲慢");
    });
});

Deno.test("变量容器 - 创建选项变量 - 创建的变量路径不能覆盖已有变量", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.属性");
    assertThrows(() => {
        变量容器.创建数值变量("黛瑞雅.属性.傲慢");
    });
});

Deno.test("变量容器 - 创建选项变量 - 创建的变量不能是已有变量的路径", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.属性.傲慢");
    assertThrows(() => {
        变量容器.创建数值变量("黛瑞雅.属性");
    });
});

Deno.test("变量容器 - 查询变量初始值 - 未定义的变量，须抛错", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    assertThrows(() => {
        变量容器.查询变量初始值("黛瑞雅.傲慢");
    });
});

Deno.test("变量容器 - 查询变量初始值 - 已定义的变量，须返回初始值", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.傲慢");
    assertEquals(变量容器.查询变量初始值("黛瑞雅.傲慢"), 0);

    变量容器.创建数值变量("黛瑞雅.荣誉", 10);
    assertEquals(变量容器.查询变量初始值("黛瑞雅.荣誉"), 10);
});

Deno.test("变量容器 - 获取初始变量对象 - 获取已经创建变量组成的对象", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.荣誉", 10);
    变量容器.创建数值变量("黛瑞雅.谦逊");
    变量容器.创建数值变量("黛瑞雅.傲慢");
    变量容器.创建数值变量("背包.书籍.魁地奇决赛锦集");

    const 变量对象 = 变量容器.获取初始变量对象();

    assertEquals(变量对象, {
        黛瑞雅: { 荣誉: 10, 谦逊: 0, 傲慢: 0 },
        背包: { 书籍: { 魁地奇决赛锦集: 0 } },
    });
});

Deno.test("变量容器 - 获取变量对象", () => {
    const 选项记录器 = new 选项记录器类();
    const 变量容器 = new 变量容器类(选项记录器);

    变量容器.创建数值变量("黛瑞雅.荣誉", 10);
    变量容器.创建数值变量("黛瑞雅.谦逊", 8);
    变量容器.创建数值变量("黛瑞雅.傲慢");
    变量容器.创建数值变量("背包.书籍.魁地奇决赛锦集");

    选项记录器.定义新记录({
        编号: 0,
        日期: "1992-06-05",
        描述: "第一次选项",
        选项模式: "单选",
        可选项: [
            { 编号: 0, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.傲慢 += 1) },
            { 编号: 1, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.谦逊 += 2) },
        ],
    });

    选项记录器.定义新记录({
        编号: 1,
        日期: "1992-06-05",
        描述: "第二次选项",
        选项模式: "多选",
        可选项: [
            { 编号: 0, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.荣誉 -= 5) },
            { 编号: 1, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.傲慢 += 4) },
            { 编号: 2, 执行结果: ({ 黛瑞雅 }) => (黛瑞雅.谦逊 += 3, 黛瑞雅.荣誉 += 2) },
            { 编号: 3, 执行结果: ({ 背包 }) => (背包.书籍.魁地奇决赛锦集 += 1) },
        ],
    });

    选项记录器.记录([
        { 编号: 0, 选项: 1 },
        { 编号: 1, 选项: 0 },
        { 编号: 1, 选项: 1 },
        { 编号: 1, 选项: 2 },
        { 编号: 1, 选项: 3 },
    ]);

    const 变量对象 = 变量容器.获取变量对象();

    console.log(变量对象);

    assertEquals(变量对象, {
        黛瑞雅: { 荣誉: 7, 谦逊: 13, 傲慢: 4 },
        背包: { 书籍: { 魁地奇决赛锦集: 1 } },
    });
});
